In [1]:
!pip install ipython-sql

!pip install mysqlclient
!pip install --force-reinstall PrettyTable==3.5.0

Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.16.0-py3-none-any.whl.metadata (33 kB)
Requirement already satisfied: ipython in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython-sql) (8.27.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading sqlalchemy-2.0.43-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.3-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython-sql) (1.16.0)
Collecting ipython-genutils (from ipython-sql)
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Collecting greenlet>=1 (from sqlalchemy>=2.0->ipython-sql)
  Downloading greenlet-3.2.4-cp312-cp312-win_amd64.whl.metadata (4.2 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\86133\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: decorator in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\86133\appdata\roaming\python\python312\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\86133\appdata\roaming\python\python312\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\86133\appdata\roaming\python\python312\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\86133\appdata\roaming\python\python312\site-packages (from stack-data->ipython->ipython-sql) (2.1.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\86133\appdata\roaming\python\python312\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\86133\appdata\roaming\python\python312\site-packages (from stack-data->ipython->ipython-sql) (0.2.3)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading sqlalchemy-2.0.43-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   ---------------------------------------- 2.1/2.1 MB 23.9 MB/s eta 0:00:00
Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.16.0-py3-none-any.whl (33 kB)
Downloading sqlparse-0.5.3-py3-none-any.whl (44 kB)
Downloading greenlet-3.2.4-cp312-cp312-win_amd64.whl (299 kB)
Installing collected packages: ipython-genutils, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-3.2.4 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.16.0 sqlalchemy-2.0.43 sqlparse-0.5.3

[notice] A new release of pip is available: 25.0.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting mysqlclient
  Downloading mysqlclient-2.2.7-cp312-cp312-win_amd64.whl.metadata (4.8 kB)
Downloading mysqlclient-2.2.7-cp312-cp312-win_amd64.whl (208 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.7

[notice] A new release of pip is available: 25.0.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Collecting PrettyTable==3.5.0
  Downloading prettytable-3.5.0-py3-none-any.whl.metadata (24 kB)
Collecting wcwidth (from PrettyTable==3.5.0)
  Using cached wcwidth-0.2.13-py2.py3-none-any.whl.metadata (14 kB)
Downloading prettytable-3.5.0-py3-none-any.whl (26 kB)
Using cached wcwidth-0.2.13-py2.py3-none-any.whl (34 kB)
Installing collected packages: wcwidth, PrettyTable
  Attempting uninstall: wcwidth
    Found existing installation: wcwidth 0.2.13
    Uninstalling wcwidth-0.2.13:
      Successfully uninstalled wcwidth-0.2.13
  Attempting uninstall: PrettyTable
    Found existing installation: prettytable 3.16.0
    Uninstalling prettytable-3.16.0:
      Successfully uninstalled prettytable-3.16.0
Successfully installed PrettyTable-3.5.0 wcwidth-0.2.13

[notice] A new release of pip is available: 25.0.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql mysql://badmstudent:badmstudent@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306

In [8]:
%sql show databases

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
8 rows affected.

[('ch07_review',),
 ('information_schema',),
 ('mysql',),
 ('northwind',),
 ('performance_schema',),
 ('sales',),
 ('sys',),
 ('yelp_champaign',)]

In [9]:
%%sql
use sales;
select * from INVOICE;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
0 rows affected.
8 rows affected.

[(1001, 10014, datetime.datetime(2014, 1, 16, 0, 0)),
 (1002, 10011, datetime.datetime(2014, 1, 16, 1, 0)),
 (1003, 10012, datetime.datetime(2014, 1, 16, 1, 0)),
 (1004, 10011, datetime.datetime(2014, 1, 17, 0, 0)),
 (1005, 10018, datetime.datetime(2014, 1, 17, 1, 0)),
 (1006, 10014, datetime.datetime(2014, 1, 17, 2, 0)),
 (1007, 10015, datetime.datetime(2014, 1, 17, 2, 0)),
 (1008, 10011, datetime.datetime(2014, 1, 17, 2, 0))]

In [10]:
%%sql
SELECT COUNT(*) AS num_customers
FROM CUSTOMER
WHERE CUS_AREACODE = 615;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(7,)]

In [11]:
%%sql
SELECT *
FROM EMP
WHERE EMP_DOB > '1970-12-31';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(103, 'Ms.', 'Jones', 'Anne', 'M', datetime.datetime(1974, 10, 16, 0, 0), datetime.datetime(1994, 8, 28, 0, 0), '615', '898-3456', 100),
 (104, 'Mr.', 'Lange', 'John', 'P', datetime.datetime(1971, 11, 8, 0, 0), datetime.datetime(1994, 10, 20, 0, 0), '901', '504-4430', 105),
 (105, 'Mr.', 'Williams', 'Robert', 'D', datetime.datetime(1975, 3, 14, 0, 0), datetime.datetime(1998, 11, 8, 0, 0), '615', '890-3220', None),
 (107, 'Mr.', 'Diante', 'Jorge', 'D', datetime.datetime(1974, 8, 21, 0, 0), datetime.datetime(1994, 7, 2, 0, 0), '615', '890-4567', 105),
 (115, 'Mrs.', 'Saranda', 'Hermine', 'R', datetime.datetime(1972, 7, 25, 0, 0), datetime.datetime(1993, 4, 23, 0, 0), '615', '324-5505', 105)]

In [11]:
%%sql
SELECT *
FROM EMP
WHERE EMP_FNAME = 'Rhett'
  AND (EMP_INITIAL IS NULL OR EMP_INITIAL = '');

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(102, 'Mr.', 'VanDam', 'Rhett', '', datetime.datetime(1958, 11, 14, 0, 0), datetime.datetime(1990, 12, 20, 0, 0), '901', '675-8993', 100)]

In [ ]:
%%sql
SELECT *
FROM EMP
WHERE EMP_DOB BETWEEN '1960-01-01' AND '1969-12-31';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
7 rows affected.
0 rows affected.

[]

In [13]:
%%sql
SELECT COUNT(*) AS num_reports
FROM EMP e
JOIN EMP m ON e.EMP_MGR = m.EMP_NUM
WHERE m.EMP_LNAME = 'Williams';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(6,)]

In [14]:
%%sql
SELECT *
FROM EMP
WHERE EMP_MGR IS NULL;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(100, 'Mr.', 'Kolmycz', 'George', 'D', datetime.datetime(1945, 6, 15, 0, 0), datetime.datetime(1985, 3, 15, 0, 0), '615', '324-5456', None),
 (105, 'Mr.', 'Williams', 'Robert', 'D', datetime.datetime(1975, 3, 14, 0, 0), datetime.datetime(1998, 11, 8, 0, 0), '615', '890-3220', None),
 (108, 'Mr.', 'Wiesenbach', 'Paul', 'R', datetime.datetime(1966, 2, 14, 0, 0), datetime.datetime(1992, 11, 18, 0, 0), '615', '897-4358', None)]

In [ ]:
%%sql
SELECT COUNT(*) AS num_male
FROM EMP
WHERE EMP_TITLE = 'Mr.';

%%sql
SELECT COUNT(*) AS num_female
FROM EMP
WHERE EMP_TITLE = 'Ms.';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '%%sql\nSELECT COUNT(*) AS num_female\nFROM EMP\nWHERE EMP_TITLE = 'Ms.'' at line 1")
[SQL: %%%%sql
SELECT COUNT(*) AS num_female
FROM EMP
WHERE EMP_TITLE = 'Ms.';]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [16]:
%%sql
SELECT *
FROM VENDOR
WHERE V_NAME LIKE 'B%';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(21225, 'Bryson, Inc.', 'Smithson', '615', '223-3234', 'TN', 'Y'),
 (24004, 'Brackman Bros.', 'Browning', '615', '228-1410', 'TN', 'N'),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N')]

In [17]:
%%sql
SELECT *
FROM VENDOR
WHERE V_STATE IN ('GA','FL');

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(21226, 'SuperLoo, Inc.', 'Flushing', '904', '215-8995', 'FL', 'N'),
 (22567, 'Dome Supply', 'Smith', '901', '678-1419', 'GA', 'N'),
 (23119, 'Randsets Ltd.', 'Anderson', '901', '678-3998', 'GA', 'Y'),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N'),
 (25595, 'Rubicon Systems', 'Orton', '904', '456-0092', 'FL', 'Y')]

In [18]:
%%sql
SELECT *
FROM PRODUCT
WHERE P_DESCRIPT LIKE '%saw%';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[('13-Q2/P2', '7.25-in. pwr. saw blade', datetime.datetime(2013, 12, 13, 0, 0), 32, 15, Decimal('14.99'), Decimal('0.05'), 21344),
 ('14-Q1/L3', '9.00-in. pwr. saw blade', datetime.datetime(2013, 11, 13, 0, 0), 18, 12, Decimal('17.49'), Decimal('0.00'), 21344),
 ('2232/QTY', 'B&D jigsaw, 12-in. blade', datetime.datetime(2013, 12, 30, 0, 0), 8, 5, Decimal('109.92'), Decimal('0.05'), 24288),
 ('2232/QWE', 'B&D jigsaw, 8-in. blade', datetime.datetime(2013, 12, 24, 0, 0), 6, 5, Decimal('99.87'), Decimal('0.05'), 24288),
 ('89-WRE-Q', 'Hicut chain saw, 16 in.', datetime.datetime(2014, 2, 7, 0, 0), 11, 5, Decimal('256.99'), Decimal('0.05'), 24288)]

In [19]:
%%sql
SELECT P_DESCRIPT
FROM PRODUCT
WHERE P_DESCRIPT LIKE '%hammer%'
  AND (V_CODE IS NULL OR V_CODE = 0);

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[('Sledge hammer, 12 lb.',)]

In [20]:
%%sql
SELECT DISTINCT v.V_NAME
FROM VENDOR v
JOIN PRODUCT p ON p.V_CODE = v.V_CODE
WHERE p.P_DESCRIPT LIKE '%screw%';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
2 rows affected.

[('Bryson, Inc.',), ('D&E Supply',)]

In [5]:
%%sql
SELECT v.*
FROM VENDOR v
WHERE v.V_CODE NOT IN (SELECT DISTINCT V_CODE FROM PRODUCT WHERE V_CODE IS NOT NULL);

SELECT v.*
FROM VENDOR v
LEFT JOIN PRODUCT p ON p.V_CODE = v.V_CODE
WHERE p.V_CODE IS NULL;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
(MySQLdb.OperationalError) (1046, 'No database selected')
[SQL: SELECT v.*
FROM VENDOR v
WHERE v.V_CODE NOT IN (SELECT DISTINCT V_CODE FROM PRODUCT WHERE V_CODE IS NOT NULL);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql
SELECT *
FROM PRODUCT
ORDER BY P_PRICE ASC
LIMIT 1;

SELECT *
FROM PRODUCT
WHERE P_PRICE = (SELECT MIN(P_PRICE) FROM PRODUCT);

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.
1 rows affected.

[('54778-2T', 'Rat-tail file, 1/8-in. fine', datetime.datetime(2013, 12, 15, 0, 0), 43, 20, Decimal('4.99'), Decimal('0.00'), 21344)]

In [ ]:
#q1
%%sql
SELECT *
FROM VENDOR v
WHERE NOT EXISTS (
    SELECT 1
    FROM PRODUCT p
    WHERE p.V_CODE = v.V_CODE
);

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(21226, 'SuperLoo, Inc.', 'Flushing', '904', '215-8995', 'FL', 'N'),
 (22567, 'Dome Supply', 'Smith', '901', '678-1419', 'GA', 'N'),
 (24004, 'Brackman Bros.', 'Browning', '615', '228-1410', 'TN', 'N'),
 (25443, 'B&K, Inc.', 'Smith', '904', '227-0093', 'FL', 'N'),
 (25501, 'Damal Supplies', 'Smythe', '615', '890-3529', 'TN', 'N')]

In [ ]:
#q2
%%sql
SELECT *
FROM PRODUCT
WHERE P_PRICE = (SELECT MIN(P_PRICE) FROM PRODUCT);

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[('54778-2T', 'Rat-tail file, 1/8-in. fine', datetime.datetime(2013, 12, 15, 0, 0), 43, 20, Decimal('4.99'), Decimal('0.00'), 21344)]

In [ ]:
#q3
%%sql
SELECT COUNT(*) AS num_products
FROM PRODUCT
WHERE P_PRICE < (SELECT AVG(P_PRICE) FROM PRODUCT);

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(11,)]

In [ ]:
#q4
%%sql
SELECT c.CUS_FNAME, c.CUS_LNAME, COUNT(i.INV_NUMBER) AS num_invoices
FROM CUSTOMER c
JOIN INVOICE i ON c.CUS_CODE = i.CUS_CODE
GROUP BY c.CUS_CODE, c.CUS_FNAME, c.CUS_LNAME;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[('Leona', 'Dunne', 3),
 ('Kathy', 'Smith', 1),
 ('Myron', 'Orlando', 2),
 ('Amy', "O'Brian", 1),
 ('Anne', 'Farriss', 1)]

In [ ]:
#q5
%%sql
SELECT SUM(P_QOH * P_PRICE) AS total_inventory_value
FROM PRODUCT;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
1 rows affected.

[(Decimal('15084.52'),)]

In [ ]:
#q6
%%sql
SELECT v.V_CODE, v.V_NAME, SUM(p.P_QOH * p.P_PRICE) AS total_value
FROM VENDOR v
LEFT JOIN PRODUCT p ON v.V_CODE = p.V_CODE
GROUP BY v.V_CODE, v.V_NAME;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
11 rows affected.

[(21225, 'Bryson, Inc.', Decimal('1431.13')),
 (21226, 'SuperLoo, Inc.', None),
 (21231, 'D&E Supply', Decimal('2002.65')),
 (21344, 'Gomez Bros.', Decimal('1009.07')),
 (22567, 'Dome Supply', None),
 (23119, 'Randsets Ltd.', Decimal('1611.02')),
 (24004, 'Brackman Bros.', None),
 (24288, 'ORDVA, Inc.', Decimal('4305.47')),
 (25443, 'B&K, Inc.', None),
 (25501, 'Damal Supplies', None),
 (25595, 'Rubicon Systems', Decimal('3506.42'))]

In [ ]:
#q7
%%sql
SELECT v.V_CODE, v.V_NAME, SUM(p.P_QOH * p.P_PRICE) AS total_value
FROM VENDOR v
LEFT JOIN PRODUCT p ON v.V_CODE = p.V_CODE
GROUP BY v.V_CODE, v.V_NAME
HAVING SUM(p.P_QOH * p.P_PRICE) > 2000;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(21231, 'D&E Supply', Decimal('2002.65')),
 (24288, 'ORDVA, Inc.', Decimal('4305.47')),
 (25595, 'Rubicon Systems', Decimal('3506.42'))]

In [ ]:
#q8
%%sql
SELECT v.V_CODE, v.V_NAME, p.P_CODE, p.P_DESCRIPT
FROM VENDOR v
LEFT JOIN PRODUCT p ON v.V_CODE = p.V_CODE
WHERE v.V_STATE = 'FL';

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
5 rows affected.

[(21226, 'SuperLoo, Inc.', None, None),
 (25443, 'B&K, Inc.', None, None),
 (25595, 'Rubicon Systems', '11QER/31', 'Power painter, 15 psi., 3-nozzle'),
 (25595, 'Rubicon Systems', '2238/QPD', 'B&D cordless drill, 1/2-in.'),
 (25595, 'Rubicon Systems', 'WR3/TT3', 'Steel matting, 4\'x8\'x1/6", .5" mesh')]

In [ ]:
#q9
%%sql
SELECT c.CUS_FNAME, c.CUS_LNAME, i.INV_NUMBER,
       ROUND(SUM(l.LINE_UNITS * l.LINE_PRICE), 2) AS invoice_value
FROM CUSTOMER c
JOIN INVOICE i ON c.CUS_CODE = i.CUS_CODE
JOIN LINE l ON i.INV_NUMBER = l.INV_NUMBER
GROUP BY c.CUS_FNAME, c.CUS_LNAME, i.INV_NUMBER;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
8 rows affected.

[('Leona', 'Dunne', 1002, Decimal('9.98')),
 ('Leona', 'Dunne', 1004, Decimal('34.87')),
 ('Leona', 'Dunne', 1008, Decimal('399.15')),
 ('Kathy', 'Smith', 1003, Decimal('153.85')),
 ('Myron', 'Orlando', 1001, Decimal('24.94')),
 ('Myron', 'Orlando', 1006, Decimal('397.83')),
 ('Amy', "O'Brian", 1007, Decimal('34.97')),
 ('Anne', 'Farriss', 1005, Decimal('70.44'))]

In [ ]:
#q10
%%sql
SELECT i.INV_NUMBER, COUNT(l.LINE_NUMBER) AS num_products
FROM INVOICE i
JOIN LINE l ON i.INV_NUMBER = l.INV_NUMBER
GROUP BY i.INV_NUMBER
HAVING COUNT(l.LINE_NUMBER) > 2;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
3 rows affected.

[(1003, 3), (1006, 4), (1008, 3)]

In [ ]:
#q11
%%sql
SELECT c.CUS_FNAME, c.CUS_LNAME, i.INV_NUMBER, p.P_DESCRIPT,
       l.LINE_UNITS, l.LINE_PRICE,
       (l.LINE_UNITS * l.LINE_PRICE) AS line_total
FROM CUSTOMER c
JOIN INVOICE i ON c.CUS_CODE = i.CUS_CODE
JOIN LINE l ON i.INV_NUMBER = l.INV_NUMBER
JOIN PRODUCT p ON l.P_CODE = p.P_CODE
ORDER BY c.CUS_LNAME, c.CUS_FNAME, i.INV_NUMBER;

 * mysql://badmstudent:***@badmstudent.cte4bvaqxbgn.us-east-2.rds.amazonaws.com:3306
18 rows affected.

[('Leona', 'Dunne', 1002, 'Rat-tail file, 1/8-in. fine', 2, Decimal('4.99'), Decimal('9.98')),
 ('Leona', 'Dunne', 1004, 'Rat-tail file, 1/8-in. fine', 3, Decimal('4.99'), Decimal('14.97')),
 ('Leona', 'Dunne', 1004, 'Claw hammer', 2, Decimal('9.95'), Decimal('19.90')),
 ('Leona', 'Dunne', 1008, 'PVC pipe, 3.5-in., 8-ft', 5, Decimal('5.87'), Decimal('29.35')),
 ('Leona', 'Dunne', 1008, 'Steel matting, 4\'x8\'x1/6", .5" mesh', 3, Decimal('119.95'), Decimal('359.85')),
 ('Leona', 'Dunne', 1008, 'Claw hammer', 1, Decimal('9.95'), Decimal('9.95')),
 ('Anne', 'Farriss', 1005, 'PVC pipe, 3.5-in., 8-ft', 12, Decimal('5.87'), Decimal('70.44')),
 ('Amy', "O'Brian", 1007, '7.25-in. pwr. saw blade', 2, Decimal('14.99'), Decimal('29.98')),
 ('Amy', "O'Brian", 1007, 'Rat-tail file, 1/8-in. fine', 1, Decimal('4.99'), Decimal('4.99')),
 ('Myron', 'Orlando', 1001, '7.25-in. pwr. saw blade', 1, Decimal('14.99'), Decimal('14.99')),
 ('Myron', 'Orlando', 1001, 'Claw hammer', 1, Decimal('9.95'), Decimal('9.95')),
 ('Myron', 'Orlando', 1006, '1.25-in. metal screw, 25', 3, Decimal('6.99'), Decimal('20.97')),
 ('Myron', 'Orlando', 1006, 'B&D jigsaw, 12-in. blade', 1, Decimal('109.92'), Decimal('109.92')),
 ('Myron', 'Orlando', 1006, 'Claw hammer', 1, Decimal('9.95'), Decimal('9.95')),
 ('Myron', 'Orlando', 1006, 'Hicut chain saw, 16 in.', 1, Decimal('256.99'), Decimal('256.99')),
 ('Kathy', 'Smith', 1003, 'Hrd. cloth, 1/4-in., 2x50', 1, Decimal('39.95'), Decimal('39.95')),
 ('Kathy', 'Smith', 1003, '7.25-in. pwr. saw blade', 5, Decimal('14.99'), Decimal('74.95')),
 ('Kathy', 'Smith', 1003, 'B&D cordless drill, 1/2-in.', 1, Decimal('38.95'), Decimal('38.95'))]